; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v4)
		(pred_1 ?v3)
		(pred_2 ?v8)
		(pred_5 ?v8)
		(pred_6 ?v3 ?v8)
		(pred_3)
		(pred_4 ?v3))

   (:action op_1
       :parameters  (?v1 ?v6)
       :precondition (and (not-eq ?v1 ?v6) 
                          (pred_2 ?v1) (pred_2 ?v6) (pred_5 ?v1))
       :effect (and  (pred_5 ?v6)
		     (not (pred_5 ?v1))))


   (:action op_3
       :parameters (?v5 ?v2)
       :precondition  (and  (pred_1 ?v5) (pred_2 ?v2)
			    (pred_6 ?v5 ?v2) (pred_5 ?v2) (pred_3))
       :effect (and (pred_4 ?v5)
		    (not (pred_6 ?v5 ?v2)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v5  ?v2)
       :precondition  (and  (pred_1 ?v5) (pred_2 ?v2)
			    (pred_4 ?v5) (pred_5 ?v2))
       :effect (and (pred_6 ?v5 ?v2)
		    (pred_3)
		    (not (pred_4 ?v5)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_01 obj_05 obj_03 obj_07 obj_06 
          obj_04 obj_08 obj_02 
)
(:init
(pred_2 obj_01)
(pred_2 obj_05)
(pred_2 obj_03)
(pred_2 obj_07)
(pred_2 obj_06)
(pred_1 obj_04)
(pred_1 obj_08)
(pred_1 obj_02)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(pred_3)
(pred_6 obj_04 obj_05)
(pred_6 obj_08 obj_07)
(pred_6 obj_02 obj_05)
(pred_5 obj_01)
)
(:goal
(and
(pred_6 obj_04 obj_01)
(pred_6 obj_08 obj_06)
(pred_6 obj_02 obj_07)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_04 obj_01) (pred_5 obj_03))
    (sometime-before  (pred_6 obj_08 obj_06) (pred_5 obj_05))
    (sometime-before  (pred_6 obj_02 obj_07) (pred_5 obj_03))
  )
)
)

; plan
1. (op_1 obj_01 obj_05)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_05)
   goals met: 0 of 3
2. (op_3 obj_04 obj_05)
   deleted: (pred_6 obj_04 obj_05) (pred_3)
   added: (pred_4 obj_04)
   goals met: 0 of 3
3. (op_1 obj_05 obj_07)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_07)
   goals met: 0 of 3
4. (op_2 obj_04 obj_07)
   deleted: (pred_4 obj_04)
   added: (pred_6 obj_04 obj_07) (pred_3)
   goals met: 0 of 3
5. (op_3 obj_08 obj_07)
   deleted: (pred_6 obj_08 obj_07) (pred_3)
   added: (pred_4 obj_08)
   goals met: 0 of 3
6. (op_1 obj_07 obj_06)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_06)
   goals met: 0 of 3
7. (op_2 obj_08 obj_06)
   deleted: (pred_4 obj_08)
   added: (pred_6 obj_08 obj_06) (pred_3)
   goals met: 1 of 3
8. (op_1 obj_06 obj_05)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_05)
   goals met: 1 of 3
9. (op_3 obj_02 obj_05)
   deleted: (pred_6 obj_02 obj_05) (pred_3)
   added: (pred_4 obj_02)
   goals met: 1 of 3
10. (op_1 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 1 of 3
11. (op_2 obj_02 obj_03)
   deleted: (pred_4 obj_02)
   added: (pred_6 obj_02 obj_03) (pred_3)
   goals met: 1 of 3
12. (op_1 obj_03 obj_07)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_07)
   goals met: 1 of 3
13. (op_3 obj_04 obj_07)
   deleted: (pred_6 obj_04 obj_07) (pred_3)
   added: (pred_4 obj_04)
   goals met: 1 of 3
14. (op_1 obj_07 obj_01)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_01)
   goals met: 1 of 3
15. (op_2 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_6 obj_04 obj_01) (pred_3)
   goals met: 2 of 3
16. (op_1 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_03)
   goals met: 2 of 3
17. (op_3 obj_02 obj_03)
   deleted: (pred_6 obj_02 obj_03) (pred_3)
   added: (pred_4 obj_02)
   goals met: 2 of 3
18. (op_1 obj_03 obj_07)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_07)
   goals met: 2 of 3
19. (op_2 obj_02 obj_07)
   deleted: (pred_4 obj_02)
   added: (pred_6 obj_02 obj_07) (pred_3)
   goals met: 3 of 3
